namespace FinaccApi.Shared.Application.Auth;

/// <summary>
/// Интерфейс для получения информации о текущем пользователе, выполняющем запрос.
/// Позволяет абстрагироваться от конкретной реализации механизма аутентификации и авторизации,
/// предоставляя единый способ доступа к данным о пользователе в любом месте приложения.
/// </summary>
public interface ICurrentUser
{
    /// <summary>
    /// Идентификатор текущего пользователя, если он аутентифицирован, иначе null.
    /// </summary>
    int? UserId { get; }

    /// <summary>
    /// Электронная почта текущего пользователя, если он аутентифицирован, иначе null.
    /// </summary>
    string? Email { get; }

    /// <summary>
    /// Признак того, что текущий пользователь аутентифицирован.
    /// </summary>
    bool IsAuthenticated { get; }
}
